# Author = Mikhalchenkov Alexandr Nikolaevich
# Group = P3109
# Date = 03.11.2025
# Variant = 501651 % 7 = 3
import re


def find_surnames(text):
    pattern = r"\b([А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)?)\s+(?:[А-ЯЁ]\.){1,2}"
    matches = re.findall(pattern, text)
    return sorted(matches)


tests = [
    {
        "input": (
            "Студент Вася вспомнил, что на своей лекции Балакшин П.В. упоминал про старшекурсников, "
            "которые будут ему помогать: Анищенко А.А., Машина Е.А. и Голованова-Иванова Д.В."
        ),
        "expected": ["Анищенко", "Балакшин", "Голованова-Иванова", "Машина"]
    },
    {
        "input": (
            "Участники олимпиады: Пахомов С.А., Сидорова-Гриневич Е.Ю., Лапина К.А., "
            "Галкин В.В., Иванов-Петров М.Н."
        ),
        "expected": ["Галкин", "Иванов-Петров", "Лапина", "Пахомов", "Сидорова-Гриневич"]
    },
    {
        "input": (
            "Список победителей: Волкова О.П., Алексеев-Лебедев И.И., "
            "Захаров М.В., Ежова Т.С."
        ),
        "expected": ["Алексеев-Лебедев", "Волкова", "Ежова", "Захаров"]
    },
    {
        "input": (
            "На конференции выступили: Смирнов А.А., Кузнецова Л.Л., "
            "Титов-Беляев Г.Г., Мельникова Д.А."
        ),
        "expected": ["Кузнецова", "Мельникова", "Смирнов", "Титов-Беляев"]
    },
    {
        "input": (
            "В списке приглашённых: Краснов А.В., Баранова-Петрова Е.Ю., "
            "Морозов С.С., Фёдорова-Васильева Н.Н."
        ),
        "expected": ["Баранова-Петрова", "Краснов", "Морозов", "Фёдорова-Васильева"]
    }
]

all_passed = True
for index, test in enumerate(tests, 1):
    result = find_surnames(test["input"])
    print(f"Тест {index}:")
    print(f"\tВход: {test["input"]}")
    print(f"\tОжидается: {", ".join(test["expected"])}")
    print(f"\tНайдено: {", ".join(result)}")
    if result != test["expected"]:
        print("Не cовпадает\n")
        all_passed = False
    else:
        print("Cовпадает\n")

if all_passed:
    print("Все тесты пройдены успешно!")
else:
    print("Что-то пошло не так!")
